_Rarzrabotki/Rarus/USO2/DataProcessors/уатПечатьЭСМ7заПериод.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<DataProcessor>
		<Properties>
			<Name>уатПечатьЭСМ7заПериод</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаВыписки</Name>
					<Comment>Дата выписки</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКон</Name>
					<Comment>Дата конца</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНач</Name>
					<Comment>Дата начала</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Контрагент</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектСтроительства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_ОбъектыСтроительства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимОтбора</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТС</Name>
					<Comment>Транспортное средство</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/AccumulationRegisters/уатВыработкаПоСтоимости.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<AccumulationRegister>
		<Properties>
			<Name>уатВыработкаПоСтоимости</Name>
			<Comment>(уат)</Comment>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>Количество</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоПараметрВыработки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВзаиморасчетов</Name>
					<Comment>Сумма в валюте взаиморасчетов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Comment>Сумма в валюте упр. учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДС</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Comment>Сумма в валюте регламентированного учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Маршрут</Name>
					<Comment>Маршрут</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.уатМаршруты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НоменклатураУслуги</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПараметрВыработки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПараметрыВыработки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПутЛист</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.уатПутевойЛист</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Comment>Ставка НДС</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТС</Name>
					<Comment>ТС</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектСтроительства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_ОбъектыСтроительства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПеревозки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатВидыПеревозок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/InformationRegisters/уатНумерацияОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>уатНумерацияОбъектов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПоследнийНомер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Год</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/ОтветственныеЛицаОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ОтветственныеЛицаОрганизаций</Name>
			<Comment>(Регл)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Руководитель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГлавныйБухгалтер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РуководительКадровойСлужбы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кассир</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтветственныйЗаБухгалтерскиеРегистры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтветственныйЗаНалоговыеРегистры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УполномоченныйПредставитель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Исполнитель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтветственныйЗаВУР</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Catalogs/ОтветственныеЛицаОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>ОтветственныеЛицаОрганизаций</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Организации</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОтветственноеЛицо</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОтветственныеЛицаОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьСсылка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПравоПодписиПоДоверенности</Name>
					<Comment>Если Ложь - то это основное ответственное лицо, если Истина - то лицо, которое только имеет право подписи документов</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеПраваПодписи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументПраваПодписи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДокументаПраваПодписи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДокументаПраваПодписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/DataProcessors/уатПечатьЭСМ7заПериод/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	уатЗащищенныеФункцииСервер.уатОбработкаФормаПриСозданииНаСервере(Отказ, СтандартнаяОбработка,ДопПараметрыОткрытие);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	уатЗащищенныеФункцииКлиент.уатОбработкаФормаПриОткрытии(Отказ, ДопПараметрыОткрытие);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Организация) Тогда
		уатОбщегоНазначенияПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(ПользователиКлиентСервер.ТекущийПользователь(), "ОсновнаяОрганизация");
	КонецЕсли;
	Если Объект.ДатаНач = '00010101' Тогда
		Объект.ДатаНач = НачалоМесяца(ТекущаяДата());
	КонецЕсли;
	Если Объект.ДатаКон = '00010101' Тогда
		Объект.ДатаКон = ТекущаяДата();
	КонецЕсли;
	Объект.ДатаВыписки = ТекущаяДата();
	
	УстановитьВидимостьДоступность();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаНачПриИзменении(Элемент)
	ПриИзмененииПериода();
КонецПроцедуры

&НаКлиенте
Процедура ДатаКонПриИзменении(Элемент)
	ПриИзмененииПериода();
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	Если уатОбщегоНазначенияТиповые.ПолучитьЗначениеРеквизита(Объект.ТС, "уатОрганизация") <> Объект.Организация Тогда
		Объект.ТС = Неопределено;
	КонецЕсли;
	Если Объект.РежимОтбора = 0 Тогда
		ЗаполнитьОбъектыСтроительства();
	Иначе
		ЗаполнитьСписТС();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	Если Объект.РежимОтбора = 0 Тогда
		ЗаполнитьОбъектыСтроительства();
	Иначе
		ЗаполнитьСписТС();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РежимОтбораПриИзменении(Элемент)
	УстановитьВидимостьДоступность();
	Если Объект.РежимОтбора = 0 Тогда
		Объект.ОбъектСтроительства = Неопределено;
		СписокТС.Очистить();
	Иначе
		Объект.ТС = Неопределено;
		СписокОбъектыСтроительства.Очистить();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТСПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.ТС) И Не ЗначениеЗаполнено(Объект.Организация) Тогда
		Объект.Организация = уатОбщегоНазначенияТиповые.ПолучитьЗначениеРеквизита(Объект.ТС, "уатОрганизация");
	КонецЕсли;
	
	Если Объект.РежимОтбора = 0 Тогда
		ЗаполнитьОбъектыСтроительства();
	Иначе
		ЗаполнитьСписТС();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТСНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтруктураОтбор = Новый Структура("уатОрганизация", Объект.Организация);
	уатИнтерфейсВводаТС.РеквизитТСНачалоВыбора(Элемент, Объект.ТС, ДанныеВыбора, СтандартнаяОбработка, СтруктураОтбор);
КонецПроцедуры

&НаКлиенте
Процедура ТСАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	СтруктураОтбор = Новый Структура("уатОрганизация", Объект.Организация);
	уатИнтерфейсВводаТС.РеквизитТСАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка, СтруктураОтбор);
КонецПроцедуры

&НаКлиенте
Процедура ТСОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	СтруктураОтбор = Новый Структура("уатОрганизация", Объект.Организация);
	уатИнтерфейсВводаТС.РеквизитТСОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка, СтруктураОтбор);
КонецПроцедуры

&НаКлиенте
Процедура ОбъектСтроительстваПриИзменении(Элемент)
	ЗаполнитьСписТС();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура НастройкаПериода(Команда)
	ДиалогПериода = Новый ДиалогРедактированияСтандартногоПериода();
	ДиалогПериода.Период.ДатаНачала = Объект.ДатаНач;
	ДиалогПериода.Период.ДатаОкончания = Объект.ДатаКон;
	ДиалогПериода.Показать(Новый ОписаниеОповещения("НастройкаПериодаЗавершение", ЭтотОбъект, Новый Структура("ДиалогПериода", ДиалогПериода)));
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПериодаЗавершение(Результат, ДополнительныеПараметры) Экспорт
    Если Результат <> Неопределено Тогда
        Объект.ДатаНач = Результат.ДатаНачала;
        Объект.ДатаКон = Результат.ДатаОкончания;
		ПриИзмененииПериода();
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	мсвТС = Новый Массив;
	мсвОбъектыСтроительства = Новый Массив;
	Если Объект.РежимОтбора = 0 Тогда
		Если ЗначениеЗаполнено(Объект.ТС) Тогда
			мсвТС.Добавить(Объект.ТС);
		КонецЕсли;
		Для Каждого ТекОбъект Из СписокОбъектыСтроительства Цикл
			Если ТекОбъект.Пометка Тогда
				мсвОбъектыСтроительства.Добавить(ТекОбъект.Значение);
			КонецЕсли;
		КонецЦикла;
	Иначе 
		Если ЗначениеЗаполнено(Объект.ОбъектСтроительства) Тогда
			мсвОбъектыСтроительства.Добавить(Объект.ОбъектСтроительства);
		КонецЕсли;
		Для Каждого ТекОбъект Из СписокТС Цикл
			Если ТекОбъект.Пометка Тогда
				мсвТС.Добавить(ТекОбъект.Значение);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ЕстьОшибки = Ложь;
	ТекстОшибки = "Невозможно выполнить операцию:";
	
	Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
		ЕстьОшибки = Истина;
		ТекстОшибки = ТекстОшибки + Символы.ПС + " - необходимо заполнить организацию.";
	Иначе
		Если НЕ уатПраваИНастройки.уатПолучитьПраваИНастройкиПользователя(Объект.Организация, "УчетВыработкиПоОбъектамСтроительства") Тогда
			ЕстьОшибки = Истина;
			ТекстОшибки = ТекстОшибки + Символы.ПС + " - по организации """ + Объект.Организация + """ не ведётся учет выработки по объектам строительства.";
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.ДатаВыписки) Тогда
		ЕстьОшибки = Истина;
		ТекстОшибки = ТекстОшибки + Символы.ПС + " - необходимо заполнить дату выписки.";
	КонецЕсли;
	
	Если Объект.РежимОтбора = 0 Тогда
		Если мсвТС.Количество() = 0 Тогда
			ЕстьОшибки = Истина;
			ТекстОшибки = ТекстОшибки + Символы.ПС + " - необходимо заполнить ТС.";
		КонецЕсли;	
		Если мсвОбъектыСтроительства.Количество() = 0 Тогда
			ЕстьОшибки = Истина;
			ТекстОшибки = ТекстОшибки + Символы.ПС + " - необходимо выбрать хотя бы один объект строительства.";
		КонецЕсли;
	Иначе
		Если мсвОбъектыСтроительства.Количество() = 0 Тогда
			ЕстьОшибки = Истина;
			ТекстОшибки = ТекстОшибки + Символы.ПС + " - необходимо заполнить объект строительства.";
		КонецЕсли;	
		Если мсвТС.Количество() = 0 Тогда
			ЕстьОшибки = Истина;
			ТекстОшибки = ТекстОшибки + Символы.ПС + " - необходимо выбрать хотя бы одно ТС.";
		КонецЕсли;
	КонецЕсли;
	
	Если ЕстьОшибки Тогда
		Сообщить(ТекстОшибки, СтатусСообщения.Важное);
		Возврат;
	КонецЕсли;
	
	ТабДок = СформироватьЭСМЗаПериод(мсвОбъектыСтроительства, мсвТС);
	ТабДок.Показать("ЭСМ-7");
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьВидимостьДоступность()
	Если Объект.РежимОтбора = 0 Тогда
		Элементы.ТС.Доступность = Истина;
		Элементы.ОбъектСтроительства.Доступность = Ложь;
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаСтраницаОбъектыСтроительства;
	Иначе
		Элементы.ТС.Доступность = Ложь;
		Элементы.ОбъектСтроительства.Доступность = Истина;
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаСтраницаТС;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииПериода()
	Если Объект.РежимОтбора = 0 Тогда
		ЗаполнитьОбъектыСтроительства();
	Иначе
		ЗаполнитьСписТС();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОбъектыСтроительства()
	СписокОбъектыСтроительства.Очистить();
	
	Если ЗначениеЗаполнено(Объект.Организация) И ЗначениеЗаполнено(Объект.ТС) Тогда	
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	уатВыработкаПоСтоимостиОбороты.ОбъектСтроительства
		|ИЗ
		|	РегистрНакопления.уатВыработкаПоСтоимости.Обороты(
		|			&ДатаНач,
		|			&ДатаКон,
		|			,
		|			ТС = &ТС
		|				И Организация = &Организация
		|				И ОбъектСтроительства <> ЗНАЧЕНИЕ(Справочник.СМ_ОбъектыСтроительства.ПустаяСсылка)
		|				И (&КонтрагентНеЗаполнен
		|					ИЛИ Контрагент = &Контрагент)
		|				И (ПараметрВыработки = ЗНАЧЕНИЕ(Справочник.уатПараметрыВыработки.ВремяВРаботе)
		|					ИЛИ ПараметрВыработки = ЗНАЧЕНИЕ(Справочник.уатПараметрыВыработки.ВремяСпециальнойРаботы))) КАК уатВыработкаПоСтоимостиОбороты";
		
		Запрос.УстановитьПараметр("ДатаНач", НачалоДня(Объект.ДатаНач));
		Запрос.УстановитьПараметр("ДатаКон", КонецДня(Объект.ДатаКон));
		Запрос.УстановитьПараметр("ТС", Объект.ТС);
		Запрос.УстановитьПараметр("Организация", Объект.Организация);
		Запрос.УстановитьПараметр("КонтрагентНеЗаполнен",  ?(ЗначениеЗаполнено(Объект.Контрагент), Ложь, Истина));
		Запрос.УстановитьПараметр("Контрагент", Объект.Контрагент);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			СписокОбъектыСтроительства.Добавить(Выборка.ОбъектСтроительства);
		КонецЦикла;
	КонецЕсли;			
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписТС()
	СписокТС.Очистить();
	
	Если ЗначениеЗаполнено(Объект.Организация) И ЗначениеЗаполнено(Объект.ОбъектСтроительства) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	уатВыработкаПоСтоимостиОбороты.ТС
		|ИЗ
		|	РегистрНакопления.уатВыработкаПоСтоимости.Обороты(
		|			&ДатаНач,
		|			&ДатаКон,
		|			,
		|				Организация = &Организация
		|				И ТС <> ЗНАЧЕНИЕ(Справочник.ТранспортныеСредства.ПустаяСсылка)
		|				И ОбъектСтроительства = &ОбъектСтроительства
		|				И (&КонтрагентНеЗаполнен
		|					ИЛИ Контрагент = &Контрагент)
		|				И (ПараметрВыработки = ЗНАЧЕНИЕ(Справочник.уатПараметрыВыработки.ВремяВРаботе)
		|					ИЛИ ПараметрВыработки = ЗНАЧЕНИЕ(Справочник.уатПараметрыВыработки.ВремяСпециальнойРаботы))) КАК уатВыработкаПоСтоимостиОбороты";
		
		Запрос.УстановитьПараметр("ДатаНач", НачалоДня(Объект.ДатаНач));
		Запрос.УстановитьПараметр("ДатаКон", КонецДня(Объект.ДатаКон));
		Запрос.УстановитьПараметр("ОбъектСтроительства", Объект.ОбъектСтроительства);
		Запрос.УстановитьПараметр("Организация", Объект.Организация);
		Запрос.УстановитьПараметр("КонтрагентНеЗаполнен",  ?(ЗначениеЗаполнено(Объект.Контрагент), Ложь, Истина));
		Запрос.УстановитьПараметр("Контрагент", Объект.Контрагент);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			СписокТС.Добавить(Выборка.ТС);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция СформироватьЭСМЗаПериод(мМассивОбъектовСтроительства, мМассивТС)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	уатВыработкаПоСтоимостиОбороты.Организация КАК Организация,
	|	уатВыработкаПоСтоимостиОбороты.Контрагент КАК Контрагент,
	|	уатВыработкаПоСтоимостиОбороты.ОбъектСтроительства КАК ОбъектСтроительства,
	|	уатВыработкаПоСтоимостиОбороты.Регистратор КАК Регистратор,
	|	уатВыработкаПоСтоимостиОбороты.ПутЛист,
	|	уатВыработкаПоСтоимостиОбороты.ТС КАК ТС,
	|	уатВыработкаПоСтоимостиОбороты.НоменклатураУслуги КАК НоменклатураУслуги,
	|	уатВыработкаПоСтоимостиОбороты.КоличествоОборот КАК КоличествоОборот,
	|	уатВыработкаПоСтоимостиОбороты.СуммаОборот КАК СуммаОборот,
	|	уатВыработкаПоСтоимостиОбороты.СуммаНДСОборот КАК СуммаНДСОборот,
	|	уатВыработкаПоСтоимостиОбороты.Регистратор.СуммаВключаетНДС КАК СуммаВключаетНДС
	|ИЗ
	|	РегистрНакопления.уатВыработкаПоСтоимости.Обороты(
	|			&ДатаНач,
	|			&ДатаКон,
	|			Регистратор,
	|			Организация = &Организация
	|				И ТС В (&ТС)
	|				И ОбъектСтроительства В (&ОбъектСтроительства)
	|				И (&КонтрагентНеЗаполнен
	|					ИЛИ Контрагент = &Контрагент)
	|				И (ПараметрВыработки = ЗНАЧЕНИЕ(Справочник.уатПараметрыВыработки.ВремяВРаботе)
	|					ИЛИ ПараметрВыработки = ЗНАЧЕНИЕ(Справочник.уатПараметрыВыработки.ВремяСпециальнойРаботы))) КАК уатВыработкаПоСтоимостиОбороты
	|ИТОГИ
	|	МАКСИМУМ(Организация),
	|	МАКСИМУМ(Контрагент),
	|	МАКСИМУМ(ТС),
	|	СУММА(КоличествоОборот),
	|	СУММА(СуммаОборот),
	|	СУММА(СуммаНДСОборот)
	|ПО
	|	ОбъектСтроительства,
	|	Контрагент,
	|	ТС,
	|	Регистратор,
	|	НоменклатураУслуги";
	
	Запрос.УстановитьПараметр("ДатаНач", НачалоДня(Объект.ДатаНач));
	Запрос.УстановитьПараметр("ДатаКон", КонецДня(Объект.ДатаКон));
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("ТС", мМассивТС);
	Запрос.УстановитьПараметр("ОбъектСтроительства", мМассивОбъектовСтроительства);
	Запрос.УстановитьПараметр("КонтрагентНеЗаполнен",  ?(ЗначениеЗаполнено(Объект.Контрагент), Ложь, Истина));
	Запрос.УстановитьПараметр("Контрагент", Объект.Контрагент);
	
	ВыборкаЗапроса = Запрос.Выполнить();
	
	ТабДок = уатПечать_ЭСМ7_за_период(ВыборкаЗапроса, НачалоДня(Объект.ДатаНач), КонецДня(Объект.ДатаКон), Объект.ДатаВыписки);
	
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.ОтображатьСетку     = Ложь;
	ТабДок.Защита = Истина;
	Табдок.ТолькоПросмотр = Истина;
	
	Возврат ТабДок;
	
КонецФункции

#КонецОбласти


#Область Печать

// Формирует печатные формы ЭСМ7 за период
//
// Параметры:
// Выборка - Выборка результата запроса по объектам строительства
// ДатаНач - Дата, с которой получаем данные
// ДатаКон - Дата, до которой получаем данные
// ДатаВыписки - Дата, на которую формируем печатные формы
//
Функция уатПечать_ЭСМ7_за_период(Выборка, ДатаНач, ДатаКон, ДатаВыписки) Экспорт
	ТабДокумент = Новый ТабличныйДокумент;
	
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ТТД_ЭСМ7";
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабДокумент.ПолеСверху 	= 0;
	ТабДокумент.ПолеСлева 	= 0;
	ТабДокумент.ПолеСнизу 	= 0;
	ТабДокумент.ПолеСправа 	= 0;
	
	НачатьТранзакцию();
	
	мПериодНумерации = ?(ЗначениеЗаполнено(ДатаВыписки),НачалоГода(ДатаВыписки),НачалоГода(ТекущаяДата()));
	СоответствиеНомеров = ПолучитьНачальныеНомераДляПечатнойФормы(мПериодНумерации);
	
	//управляемая блокировка
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.уатНумерацияОбъектов");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	Блокировка.Заблокировать();
	
	ВыборкаОбъект = Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаФизЛицаОрг = Неопределено;
	Пока ВыборкаОбъект.Следующий() Цикл
		ВыборкаКонтрагент = ВыборкаОбъект.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаКонтрагент.Следующий() Цикл
			
			ВыборкаТС = ВыборкаКонтрагент.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			МассивВодителей = Новый Массив;		
			
			Пока ВыборкаТС.Следующий() Цикл
				
				ВыборкаРегистратор = ВыборкаТС.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				
				Макет = ПолучитьОбщийМакет("ПФ_MXL_уатЭСМ7");
				
				мМаксСтрок = 7;
				
				
				Обл = Макет.ПолучитьОбласть("Лицевая");
				
				Если ВыборкаФизЛицаОрг = Неопределено тогда
					ВыборкаФизЛицаОрг = ПечатьЭСМ7ЗаПериодПолучитьВыборкуОтветственныхЛиц(ВыборкаТС,ДатаВыписки);
				КонецЕсли;
				
				ПечатьЭСМ7ЗаПериодЗаполнитьШапку(Обл, ДатаНач, ДатаКон, ДатаВыписки, СоответствиеНомеров, ВыборкаТС,ВыборкаФизЛицаОрг);
				
				Сч = 1;
				КоличИтого 	  = 0;
				СуммаИтого 	  = 0;
				СуммаНДСИтого = 0;
				Всего 		  = 0;
				
				Пока ВыборкаРегистратор.Следующий() Цикл
					
					//Сообщить(ВыборкаРегистратор.Регистратор);
					
					ВыборкаУслуга = ВыборкаРегистратор.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					
					Пока ВыборкаУслуга.Следующий() Цикл
						
						Напечатали = Ложь;
						
						Обл.Параметры.Объект = ВыборкаУслуга.ОбъектСтроительства;
						
						Обл.Параметры["Услуга" + Сч] = ВыборкаУслуга.НоменклатураУслуги;
						Обл.Параметры["НаименованиеРаботы" + Сч] = ВыборкаУслуга.НоменклатураУслуги.Наименование;
						Обл.Параметры["КодРаботы" + Сч] = ВыборкаУслуга.НоменклатураУслуги.Код;
						ТекКоличество = Цел(ВыборкаУслуга.КоличествоОборот) + Окр((ВыборкаУслуга.КоличествоОборот - Цел(ВыборкаУслуга.КоличествоОборот))*60/100, 2);
						Обл.Параметры["Количество" + Сч] = ТекКоличество;
						Обл.Параметры["Цена" + Сч] = ВыборкаУслуга.Суммаоборот / ВыборкаУслуга.КоличествоОборот;
						Обл.Параметры["Сумма" + Сч] = ВыборкаУслуга.СуммаОборот;
						
						КоличИтого = уатЗащищенныеФункцииСервер.СложитьВремя(КоличИтого, ТекКоличество);
						СуммаИтого = СуммаИтого + ВыборкаУслуга.СуммаОборот;
						СуммаНДСИтого = СуммаНДСИтого + ВыборкаУслуга.СуммаНДСОборот;
						Всего = Всего + ?(ВыборкаРегистратор.СуммаВключаетНДС, ВыборкаУслуга.СуммаОборот, ВыборкаУслуга.СуммаОборот + ВыборкаУслуга.СуммаНДСОборот);
						
						Сч = Сч + 1;
						мМаксСтрок = мМаксСтрок - 1;
						
						ВыборкаВодителей = ВыборкаУслуга.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);	
						Пока ВыборкаВодителей.Следующий() Цикл
							Водитель1 = уатОбщегоНазначения.уатФИОСотрудникаПолноеСтрокой(ВыборкаВодителей.ПутЛист.Водитель1, ДатаВыписки);
							Если МассивВодителей.Найти(Водитель1) = Неопределено Тогда
								МассивВодителей.Добавить(Водитель1);
							КонецЕсли;
							Если ЗначениеЗаполнено(ВыборкаВодителей.ПутЛист.Водитель2) И МассивВодителей.Найти(уатОбщегоНазначения.уатФИОСотрудникаПолноеСтрокой(ВыборкаВодителей.ПутЛист.Водитель2, ДатаВыписки)) = Неопределено Тогда
								МассивВодителей.Добавить(уатОбщегоНазначения.уатФИОСотрудникаПолноеСтрокой(ВыборкаВодителей.ПутЛист.Водитель2, ДатаВыписки));
							КонецЕсли;	
						КонецЦикла;
						
						Если мМаксСтрок = 0 Тогда
							ПечатьЭСМ7ЗаПериодЗаполнитьПодвал(Обл, КоличИтого, СуммаИтого, СуммаНДСИтого, Всего, МассивВодителей);
							
							ТабДокумент.Вывести(Обл);
							ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();					
							
							Макет = ПолучитьОбщийМакет("ПФ_MXL_уатЭСМ7");
							
							мМаксСтрок = 7;
							
							Обл = Макет.ПолучитьОбласть("Лицевая");
							
							ПечатьЭСМ7ЗаПериодЗаполнитьШапку(Обл, ДатаНач, ДатаКон, ДатаВыписки,СоответствиеНомеров, ВыборкаТС,ВыборкаФизЛицаОрг);
							
							Сч = 1;
							КоличИтого 	  = 0;
							СуммаИтого 	  = 0;
							СуммаНДСИтого = 0;
							Всего		  = 0;
							Напечатали = Истина;
							
						КонецЕсли;
						
					КонецЦикла;
					
				КонецЦикла;
				
				Если НЕ Напечатали Тогда
					ПечатьЭСМ7ЗаПериодЗаполнитьПодвал(Обл, КоличИтого, СуммаИтого, СуммаНДСИтого, Всего, МассивВодителей);
					
					ТабДокумент.Вывести(Обл);
					ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
					
				КонецЕсли;
				
				МассивВодителей.Очистить();
				
			КонецЦикла; //конец цикла по ТС
		КонецЦикла; //конец цикла по Контрагентам
	КонецЦикла; //конец цикла по Объектам строительства
	
	УстановитьНомераОбъектов(СоответствиеНомеров,мПериодНумерации);
	ЗафиксироватьТранзакцию();
	
	Возврат ТабДокумент;
	
КонецФункции // уатПечать_ЭСМ7_за_период()

Процедура ПечатьЭСМ7ЗаПериодЗаполнитьШапку(Обл,ДатаНач, ДатаКон, ДатаВыписки,СоответствиеНомеров, ВыборкаКонтрагент,ВыборкаФизЛица)
	
	Обл.Параметры.ДатаВыезда 	  = Формат(ДатаНач,"ДФ=дд.ММ.гг"); 
	Обл.Параметры.ДатаВозвращения = Формат(ДатаКон,"ДФ=дд.ММ.гг"); 
	Обл.Параметры.ДатаСостДень 	  = Формат(ДатаВыписки,"ДФ=дд");
	Обл.Параметры.ДатаСостМесяц   = Формат(ДатаВыписки,"ДФ=ММ");
	Обл.Параметры.ДатаСостГод 	  = Формат(ДатаВыписки,"ДФ=гг");
	
	мПрефикс = "";
	уатОбщегоНазначенияТиповые.уатДобавитьПрефиксУзла(мПрефикс);
	мПрефикс = мПрефикс + ВыборкаКонтрагент.Организация.Префикс;
	
	мНомерСправки = (СоответствиеНомеров[ВыборкаКонтрагент.Организация] + 1);
	мФормат = 11 - СтрДлина(мПрефикс);
	Обл.Параметры.НомерСправки = мПрефикс + Формат(мНомерСправки,"ЧЦ="+ мФормат + "; ЧРГ=0; ЧВН=; ЧГ=0" );
	СоответствиеНомеров[ВыборкаКонтрагент.Организация] = СоответствиеНомеров[ВыборкаКонтрагент.Организация] + 1;
	
	ФорматДаты = "ДЛФ='Д'";
	Обл.Параметры.ДатаВыписки = Формат(ДатаВыписки, ФорматДаты);
	Обл.Параметры.Организация = ВыборкаКонтрагент.Организация;
	Обл.Параметры.ОрганизацияПредставление = уатОбщегоНазначенияТиповыеСервер.ОписаниеОрганизации(
		уатОбщегоНазначенияСервер.СведенияОЮрФизЛице(ВыборкаКонтрагент.Организация, ДатаВыписки), "ПолноеНаименование,ОГРН,ЮридическийАдрес,Телефоны");
	Обл.Параметры.МодельТСПредставление = уатОбщегоНазначения.уатПредставлениеМоделиТС(ВыборкаКонтрагент.ТС);
	Обл.Параметры.МодельТС = ВыборкаКонтрагент.ТС.уатМодель;
	Обл.Параметры.ТранспортноеСредствоГосНомер	= ВыборкаКонтрагент.ТС.Код;
	Обл.Параметры.ТранспортноеСредство	= ВыборкаКонтрагент.ТС;
	Обл.Параметры.КодПоОКПО = ВыборкаКонтрагент.Организация.КодПоОКПО;
	
	Обл.Параметры.Заказчик = ВыборкаКонтрагент.Контрагент;
	мЗаказчик 	= уатОбщегоНазначенияТиповыеСервер.ОписаниеОрганизации(
		уатОбщегоНазначенияСервер.СведенияОЮрФизЛице(ВыборкаКонтрагент.Контрагент, ДатаВыписки), "ПолноеНаименование,ЮридическийАдрес,Телефоны");;
	Обл.Параметры.ЗаказчикПредставление = мЗаказчик;
	
	//С000640935 
	//Если СтрДлина(мЗаказчик) > 65 тогда
	//	Обл.Области.ОбластьЗаказчикПредставление.Шрифт = Новый Шрифт(Обл.Области.ОбластьЗаказчикПредставление.Шрифт,,7);
	//КонецЕсли;
	
	Обл.Параметры.ЗаказчикКодПоОКПО = ВыборкаКонтрагент.Контрагент.КодПоОКПО;
	
	ВыборкаФизЛица.сбросить();
	Если ВыборкаФизЛица.Следующий() Тогда
		ДанныеФизЛица = уатОбщегоНазначенияТиповыеСервер.ДанныеФизЛица(ВыборкаКонтрагент.Организация, ВыборкаФизЛица.ФизическоеЛицо, ДатаВыписки);
		Руководитель = ДанныеФизЛица.Представление;
		Должность = ВыборкаФизЛица.Должность;
		
		Обл.Параметры.ФИОРуководителя = Руководитель;
		Обл.Параметры.Должность = Должность;
	Иначе
		Обл.Параметры.ФИОРуководителя = ВыборкаКонтрагент.Организация;
	КонецЕсли;
	
	//заполняем должность и наименование заказчика
	мЗапросКЛ = Новый Запрос;
	мЗапросКЛ.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КонтактныеЛицаПартнеров.Ссылка,
	|	1 КАК Порядок
	|ИЗ
	|	Справочник.КонтактныеЛицаПартнеров КАК КонтактныеЛицаПартнеров
	|ГДЕ
	|	КонтактныеЛицаПартнеров.Владелец = &Владелец
	|	И КонтактныеЛицаПартнеров.ДолжностьПоВизитке ПОДОБНО ""_иректор""
	|	И КонтактныеЛицаПартнеров.ДатаРегистрацииСвязи <= &ДатаДействия
	|	И (КонтактныеЛицаПартнеров.ДатаПрекращенияСвязи > &ДатаДействия
	|			ИЛИ КонтактныеЛицаПартнеров.ДатаПрекращенияСвязи = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КонтактныеЛицаПартнеров.Ссылка,
	|	2
	|ИЗ
	|	Справочник.КонтактныеЛицаПартнеров КАК КонтактныеЛицаПартнеров
	|ГДЕ
	|	КонтактныеЛицаПартнеров.Владелец = &Владелец
	|	И КонтактныеЛицаПартнеров.ДолжностьПоВизитке ПОДОБНО ""_л% бухгалтер""
	|	И КонтактныеЛицаПартнеров.ДатаРегистрацииСвязи <= &ДатаДействия
	|	И (КонтактныеЛицаПартнеров.ДатаПрекращенияСвязи > &ДатаДействия
	|			ИЛИ КонтактныеЛицаПартнеров.ДатаПрекращенияСвязи = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КонтактныеЛицаПартнеров.Ссылка,
	|	3
	|ИЗ
	|	Справочник.КонтактныеЛицаПартнеров КАК КонтактныеЛицаПартнеров
	|ГДЕ
	|	КонтактныеЛицаПартнеров.Владелец = &Владелец
	|	И КонтактныеЛицаПартнеров.ДатаРегистрацииСвязи <= &ДатаДействия
	|	И (КонтактныеЛицаПартнеров.ДатаПрекращенияСвязи > &ДатаДействия
	|			ИЛИ КонтактныеЛицаПартнеров.ДатаПрекращенияСвязи = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок";
	
	мЗапросКЛ.УстановитьПараметр("Владелец",     ВыборкаКонтрагент.Контрагент.Партнер);
	мЗапросКЛ.УстановитьПараметр("ДатаДействия", ДатаВыписки);
	выборкаКЛ = мЗапросКЛ.Выполнить().Выбрать();
	
	Если выборкаКЛ.Следующий() тогда
		Обл.Параметры.ДолжностьЗаказчика = выборкаКЛ.Ссылка.ДолжностьПоВизитке;
		Обл.Параметры.ФИОЗаказчика = выборкаКЛ.Ссылка.Наименование;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПечатьЭСМ7ЗаПериодЗаполнитьПодвал(Обл, КоличИтого, СуммаИтого, СуммаНДСИтого, Всего, МассивВодителей)
	Обл.Параметры.КоличествоИтого = КоличИтого;
	Обл.Параметры.СуммаИтого      = СуммаИтого;
	Обл.Параметры.СуммаНДСИтого   = СуммаНДСИтого;
	Обл.Параметры.Всего           = Всего;
	
	ОтработаноПрописью = "";
	Если ЗначениеЗаполнено(Цел(КоличИтого)) тогда
		ОтработаноПрописью = СтрЗаменить(ЧислоПрописью(Цел(КоличИтого), "L=ru_RU", "час, часа, часов, м")," 00","");
	КонецЕсли;
	Если ЗначениеЗаполнено(КоличИтого - Цел(КоличИтого)) тогда
		ОтработаноПрописью = ОтработаноПрописью + СтрЗаменить(ЧислоПрописью((КоличИтого- Цел(КоличИтого))*100, "L=ru_RU; FN=Ложь", "минута, минуты, минут, ж")," 00","");
	КонецЕсли;
	Обл.Параметры.ОтработаноМашиноЧасов = ОтработаноПрописью;
	Водители = "";
	Для Каждого ЭлементМассива Из МассивВодителей Цикл
		Водители =  Водители + ", " + ЭлементМассива;
	КонецЦикла;
	
	МассивСтрок = уатОбщегоНазначенияТиповые.уатРазбитьСтрокуНаПодстроки(Сред(Водители,3,СтрДлина(Водители)), 100);
	Если Прав(МассивСтрок[0],1) = "," Тогда
		Обл.Параметры.Водители = Лев(МассивСтрок[0],СтрДлина(МассивСтрок[0])-1);
	Иначе
		Обл.Параметры.Водители = МассивСтрок[0];
	КонецЕсли;
КонецПроцедуры

Функция ПечатьЭСМ7ЗаПериодПолучитьВыборкуОтветственныхЛиц(ВыборкаКонтрагент, ДатаВыписки)
	
	Запрос = Новый Запрос();
	
	Запрос.УстановитьПараметр("Организация", ВыборкаКонтрагент.Организация);
	Запрос.УстановитьПараметр("ОтборПоДате", ДатаВыписки);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОтветственныеЛицаОрганизаций.ФизическоеЛицо,
	|	ОтветственныеЛицаОрганизаций.Должность
	|ИЗ
	|	Справочник.ОтветственныеЛицаОрганизаций КАК ОтветственныеЛицаОрганизаций
	|ГДЕ
	|	ОтветственныеЛицаОрганизаций.ДатаНачала <= &ОтборПоДате
	|	И (ОтветственныеЛицаОрганизаций.ДатаОкончания >= &ОтборПоДате
	|			ИЛИ ОтветственныеЛицаОрганизаций.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))
	|	И ОтветственныеЛицаОрганизаций.Владелец = &Организация
	|	И ОтветственныеЛицаОрганизаций.ОтветственноеЛицо = ЗНАЧЕНИЕ(Перечисление.ОтветственныеЛицаОрганизаций.Руководитель)";
	
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции

Функция ПолучитьНачальныеНомераДляПечатнойФормы(мГодНумерации)
	
	мЗапрос = Новый Запрос;
	мЗапрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Организации.Ссылка КАК Организация,
	|	ЕСТЬNULL(уатНумерацияОбъектов.ПоследнийНомер, 0) КАК ПоследнийНомер
	|ИЗ
	|	Справочник.Организации КАК Организации
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			уатНумерацияОбъектов.Год КАК Год,
	|			уатНумерацияОбъектов.Организация КАК Организация,
	|			уатНумерацияОбъектов.ПоследнийНомер КАК ПоследнийНомер
	|		ИЗ
	|			РегистрСведений.уатНумерацияОбъектов КАК уатНумерацияОбъектов
	|		ГДЕ
	|			уатНумерацияОбъектов.Год = &Год) КАК уатНумерацияОбъектов
	|		ПО (уатНумерацияОбъектов.Организация = Организации.Ссылка)";
	мЗапрос.УстановитьПараметр("Год",НачалоГода(мГодНумерации));
	Выборка = мЗапрос.Выполнить().Выбрать();
	СоответствиеНомеров = Новый Соответствие;
	Пока Выборка.Следующий() Цикл
		СоответствиеНомеров.Вставить(Выборка.Организация,Выборка.ПоследнийНомер);
	КонецЦикла;
	
	Возврат СоответствиеНомеров;
	
КонецФункции

Процедура УстановитьНомераОбъектов(СоответствиеНомеров,мГодНумерации)
	
	мЗапрос = Новый Запрос;
	мЗапрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Организации.Ссылка КАК Организация,
	|	ЕСТЬNULL(уатНумерацияОбъектов.ПоследнийНомер, 0) КАК ПоследнийНомер
	|ИЗ
	|	Справочник.Организации КАК Организации
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			уатНумерацияОбъектов.Год КАК Год,
	|			уатНумерацияОбъектов.Организация КАК Организация,
	|			уатНумерацияОбъектов.ПоследнийНомер КАК ПоследнийНомер
	|		ИЗ
	|			РегистрСведений.уатНумерацияОбъектов КАК уатНумерацияОбъектов
	|		ГДЕ
	|			уатНумерацияОбъектов.Год = &Год) КАК уатНумерацияОбъектов
	|		ПО (уатНумерацияОбъектов.Организация = Организации.Ссылка)";
	мЗапрос.УстановитьПараметр("Год",НачалоГода(мГодНумерации));
	Выборка = мЗапрос.Выполнить().Выбрать();
	мНаборЗаписей = РегистрыСведений.уатНумерацияОбъектов.СоздатьНаборЗаписей();
	мНаборЗаписей.Отбор.Год.Установить(НачалоГода(мГодНумерации));
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.ПоследнийНомер = 0 И Выборка.ПоследнийНомер = СоответствиеНомеров[Выборка.Организация] тогда
			Продолжить;
		КонецЕсли;
		
		НовЗапись = мНаборЗаписей.Добавить();
		НовЗапись.Организация = Выборка.Организация;
		НовЗапись.Год = НачалоГода(мГодНумерации);
		НовЗапись.ПоследнийНомер = СоответствиеНомеров[Выборка.Организация];
	КонецЦикла;
	Попытка
		мНаборЗаписей.Записать();
	Исключение
	КонецПопытки;
КонецПроцедуры

#КонецОбласти
